VladimirP1/si1000-rf-beacon/extlibs/MCU/Examples/C8051F39x_37x/EEPROM/F37x_EEPROM.c
//-----------------------------------------------------------------------------
// F37x_EEPROM.c
//-----------------------------------------------------------------------------
// Copyright 2012 Silicon Laboratories, Inc.
// http://www.silabs.com
//
// Program Description:
// 
// This program writes 0xFF to all 512 bytes of EEPROM and reads all 512 bytes
// for confirmation. Secondly, the program writes 0xAA to all 512 bytes and 
// reads all 512 bytes for confirmation. Lastly, the program writes 0x55 to all  
// 512 bytes and reads all 512 bytes for confirmation.
//
// How To Test:
//
// 1) Download code to the C8051F370 UDP MCU board
// 2) Run the program
//
//
// Target:         C8051F370
// Tool chain:     Generic
// Command Line:   None
//
// Release 1.3
//    - Corrected SCL and SDA sbit defintions (ST)
//      SCL is P2.2 and SDA is P2.3 when Swap = 1 
//    - 19 DEC 2012
//
// Release 1.2
//    - Corrected references to SMB1CF in SMBus_Init (ST)
//    - 27 JUL 2012
//
// Release 1.1
//    - Added comments and formatting (ST)
//    - 15 JUN 2012
//
// Release 1.0
//    - Initial Revision (BD)
//

//-----------------------------------------------------------------------------
// Includes and Device-Specific Parameters
//-----------------------------------------------------------------------------

#include <compiler_defs.h>
#include <C8051F390_defs.h>            // SFR declarations

//-----------------------------------------------------------------------------
// Global CONSTANTS
//-----------------------------------------------------------------------------


#define  SYSCLK         24500000       // System clock frequency in Hz

#define  SMB_FREQUENCY  100000         // Target SCL clock rate

#define  WRITE          0x00           // SMBus WRITE command
#define  READ           0x01           // SMBus READ command

#define LED_ON           0             // Turns the LED on
#define LED_OFF          1             // Turns the LED off

// Device addresses (7 bits, lsb is a don't care)
#define  EEPROM_ADDR    0xA0           // Device address for slave target
                                       
#define  SMB_BUFF_SIZE  0x08           // Defines the maximum number of bytes
                                       // that can be sent or received in a
                                       // single transfer

// Status vector - top 4 bits only
#define  SMB_MTSTA      0xE0           // (MT) start transmitted
#define  SMB_MTDB       0xC0           // (MT) data byte transmitted
#define  SMB_MRDB       0x80           // (MR) data byte received
// End status vector definition

#define  UPPER_MEM_BANK 0x02           // Mask to access upper 256 bytes of
                                       // EEPROM.

#define SMBUS 1
#define Swap 1

#if (SMBUS == 0)
	#define INTERRUPT_MY_SMBUS 7
	#define INTERRUPT_MY_TIMER 14
#elif (SMBUS == 1)
	#define INTERRUPT_MY_SMBUS 15
	#define INTERRUPT_MY_TIMER 16
#endif 


//-----------------------------------------------------------------------------
// Global VARIABLES
//-----------------------------------------------------------------------------
U8* pSMB_DATA_IN;                      // Global pointer for SMBus data
                                       // All receive data is written here

U8 SMB_SINGLEBYTE_OUT;                 // Global holder for single byte writes.

U8* pSMB_DATA_OUT;                     // Global pointer for SMBus data.
                                       // All transmit data is read from here

U8 SMB_DATA_LEN;                       // Global holder for number of bytes
                                       // to send or receive in the current
                                       // SMBus transfer.

U8 WORD_ADDR;                          // Global holder for the EEPROM word
                                       // address that will be accessed in
                                       // the next transfer

U8 TARGET;                             // Target SMBus slave address

U8 SEG_XDATA SAMPLE_ARRAY[512];        // Test array for EEPROM

volatile bit SMB_BUSY = 0;             // Software flag to indicate when the
                                       // EEPROM_ByteRead() or
                                       // EEPROM_ByteWrite()
                                       // functions have claimed the SMBus

volatile bit SMB_RW;                   // Software flag to indicate the
                                       // direction of the current transfer

volatile bit SMB_SENDWORDADDR;         // When set, this flag causes the ISR
                                       // to send the 8-bit <WORD_ADDR>
                                       // after sending the slave address.


volatile bit SMB_RANDOMREAD;           // When set, this flag causes the ISR
                                       // to send a START signal after sending
                                       // the word address.
                                       // For the 24LC02B EEPROM, a random read
                                       // (a read from a particular address in
                                       // memory) starts as a write then
                                       // changes to a read after the repeated
                                       // start is sent. The ISR handles this
                                       // switchover if the <SMB_RANDOMREAD>
                                       // bit is set.

volatile bit SMB_ACKPOLL;              // When set, this flag causes the ISR
                                       // to send a repeated START until the
                                       // slave has acknowledged its address


SBIT (SCL, SFR_P2, 2);                 // SMBus on P2.2
SBIT (SDA, SFR_P2, 3);                 // and P2.3



//-----------------------------------------------------------------------------
// Function PROTOTYPES
//-----------------------------------------------------------------------------

void SMBus_Init(void);
void Timer0_Init(void);
void Port_Init(void);

INTERRUPT_PROTO (TIMER3_ISR, INTERRUPT_MY_TIMER);
INTERRUPT_PROTO (SMBUS0_ISR, INTERRUPT_MY_SMBUS);

void EEPROM_ByteWrite(U16 addr, U8 dat);
void EEPROM_WriteArray(U16 dest_addr, U8* src_addr,
                       U8 len);
U8 EEPROM_ByteRead(U16 addr);
void EEPROM_ReadArray(U8* dest_addr, U16 src_addr,
                      U8 len);

