VladimirP1/si1000-rf-beacon/extlibs/MCU/Examples/C8051F39x_37x/EEPROM/F37x_EEPROM.c
//-----------------------------------------------------------------------------
// MAIN Routine
//-----------------------------------------------------------------------------
//
// Main routine performs all configuration tasks, then loops forever sending
// and receiving SMBus data to the slave EEPROM.
//
//-----------------------------------------------------------------------------

void main (void)
{
   char in_buff[8] = {0};              // Incoming data buffer
   char out_buff[8] = "ABCDEFG";       // Outgoing data buffer

   bit error_flag = 0;                 // Flag for checking EEPROM contents
   U8 i;                               // Temporary counter variable
   U16 j;                              // Temporary counter variable


   PCA0MD &= ~0x40;                    // WDTE = 0 (disable watchdog timer)
   
	

   // Set internal oscillator to divide by 2 (24500000)
   OSCICN |= 0x03;
   CLKSEL = 0x00;
   
   #if (Swap == 0)
   #elif (Swap == 1 && SMBUS == 0)
   		SMBTC |= 0x40;
   #elif (Swap == 1 && SMBUS == 1)
   		SMBTC |= 0x80;
   #endif

   #if (SMBUS == 1)
   		SFRPAGE = 0xF;	
   #endif
   // If slave is holding SDA low because of an improper SMBus reset or error
   while(!SDA)
   {
      // Provide clock pulses to allow the slave to advance out
      // of its current state. This will allow it to release SDA.
      XBR1 = 0x40;                     // Enable Crossbar
      SCL = 0;                         // Drive the clock low
      for(i = 0; i < 255; i++);        // Hold the clock low
      SCL = 1;                         // Release the clock
      while(!SCL);                     // Wait for open-drain
                                       // clock output to rise
      for(i = 0; i < 10; i++);         // Hold the clock high
      XBR1 = 0x00;                     // Disable Crossbar
   }

   Port_Init ();                       // Initialize Crossbar and GPIO

   Timer0_Init ();                     // Configure Timer0 for use as SMBus
                                       // clock source

   SMBus_Init ();                      // Configure and enable SMBus

   #if (SMBUS == 0)
		   EIE1 |= 0x01;
   #elif (SMBUS == 1)
   		EIE2 |= 0x01;                 // Enable the SMBus interrupt
   #endif

   EA = 1;                             // Global interrupt enable

   // TEST BEGIN***************************************************************

   // Write 0xFF to every byte of EEPROM
   for (j=0; j < 512; j++)
   {
      EEPROM_ByteWrite(j, (j & 0x0FF));
   }

   for (j=0; j < 512; j++)
   {
      SAMPLE_ARRAY[j] = EEPROM_ByteRead(j);
      if ( SAMPLE_ARRAY[j] != (j & 0x0FF))
	  {
         error_flag = 1;       
	  }
   }


   // Write 0xAA to every byte of EEPROM
   for (j=0; j < 512; j++)
   {
      EEPROM_ByteWrite(j, 0xAA);
   }

   for (j=0; j < 512; j++)
   {
      SAMPLE_ARRAY[j] = EEPROM_ByteRead(j);
      if ( SAMPLE_ARRAY[j] != 0xAA)
	  {
         error_flag = 1;       
	  }
   }   

   // Write 0x55 to every byte of EEPROM
   for (j=0; j < 512; j++)
   {
      EEPROM_ByteWrite(j, 0x55);
   }
    
   for (j=0; j < 512; j++)
   {
      SAMPLE_ARRAY[j] = EEPROM_ByteRead(j);
      if ( SAMPLE_ARRAY[j] != 0x55)
	  {
         error_flag = 1;       
	  }
   }   

   if (error_flag)
   {
      while(1);         // Test failed 
   }

   while(1);            // Test passed

   //TEST END******************************************************************

}


//-----------------------------------------------------------------------------
// Initialization Routines
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
// SMBus_Init()
//-----------------------------------------------------------------------------
//
// Return Value : None
// Parameters   : None
//
// The SMBus peripheral is configured as follows:
// - SMBus enabled
// - Slave mode disabled
// - Timer1 used as clock source. The maximum SCL frequency will be
//   approximately 1/3 the Timer1 overflow rate
// - Setup and hold time extensions enabled
// - Free and SCL low timeout detection enabled
//
//-----------------------------------------------------------------------------
void SMBus_Init (void)
{
   unsigned char SFRPAGEsave = SFRPAGE;
   #if (SMBUS == 0)
   SFRPAGE = 0x00;
   SMB0CF = 0x54;                      // Use Timer0 overflows as SMBus clock
                                       // source;
                                       // Disable slave mode;
                                       // Enable setup & hold time extensions;
                                       // Enable SMBus Free timeout detect;
                                       // Disable SCL low timeout detect;

   SMB0CF |= 0x80;                     // Enable SMBus;
   #elif (SMBUS == 1)
   SFRPAGE = 0x0F;
   SMB1CF = 0x54;                      // Use Timer0 overflows as SMBus clock
                                       // source;
                                       // Disable slave mode;
                                       // Enable setup & hold time extensions;
                                       // Enable SMBus Free timeout detect;
                                       // Disable SCL low timeout detect;

   SMB1CF |= 0x80;                     // Enable SMBus;
   #endif
   SFRPAGE = SFRPAGEsave;
}

//-----------------------------------------------------------------------------
// Timer0_Init()
//-----------------------------------------------------------------------------
//
// Return Value : None
// Parameters   : None
//
// Timer0 is configured as the SMBus clock source as follows:
// - Timer0 in 8-bit auto-reload mode
// - SYSCLK / 12 as Timer0 clock source
// - Timer0 overflow rate => 3 * SMB_FREQUENCY
// - The maximum SCL clock rate will be ~1/3 the Timer0 overflow rate
// - Timer0 enabled
//
//-----------------------------------------------------------------------------
void Timer0_Init (void)
{
// Make sure the Timer can produce the appropriate frequency in 8-bit mode
// Supported SMBus Frequencies range from 10kHz to 100kHz.  The CKCON register
// settings may need to change for frequencies outside this range.
	
