VladimirP1/si1000-rf-beacon/extlibs/MCU/Examples/C8051F39x_37x/EEPROM/F37x_EEPROM.c
//-----------------------------------------------------------------------------
// Support Functions
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
// EEPROM_ByteWrite ()
//-----------------------------------------------------------------------------
//
// Return Value : None
// Parameters   :
//   1) U16 addr - address to write in the EEPROM
//                        range is: 0 to 512
//
//   2) U8 dat - data to write to the address <addr> in the EEPROM
//                        range is full range of character: 0 to 255
//
// This function writes the value in <dat> to location <addr> in the EEPROM
// then polls the EEPROM until the write is complete.
//
//-----------------------------------------------------------------------------
void EEPROM_ByteWrite(U16 addr, U8 dat)
{
   while (SMB_BUSY);                   // Wait for SMBus to be free.
   SMB_BUSY = 1;                       // Claim SMBus (set to busy)

   // Set SMBus ISR parameters
   TARGET = EEPROM_ADDR;               // Set target slave address
   SMB_RW = WRITE;                     // Mark next transfer as a write
   SMB_SENDWORDADDR = 1;               // Send Word Address after Slave Address
   SMB_RANDOMREAD = 0;                 // Do not send a START signal after
                                       // the word address
   SMB_ACKPOLL = 1;                    // Enable Acknowledge Polling (The ISR
                                       // will automatically restart the
                                       // transfer if the slave does not
                                       // acknoledge its address.

   if ((addr & 0x100) == 0x100)        // Check to see if accessing upper 256
                                       // bytes of EEPROM
   {                                   
      WORD_ADDR = (addr & 0x0FF);      // Set the target address of EEPROM
      TARGET |= UPPER_MEM_BANK;        // Set bit to access upper 256 bytes of
   }                                   // EEPROM
   else
   {
      WORD_ADDR = addr;                // Set the target address in the
   }                                   // EEPROM's internal memory space

   // Specify the Outgoing Data
   SMB_SINGLEBYTE_OUT = dat;           // Store <dat> (local variable) in a
                                       // global variable so the ISR can read
                                       // it after this function exits

   // The outgoing data pointer points to the <dat> variable
   pSMB_DATA_OUT = &SMB_SINGLEBYTE_OUT;

   SMB_DATA_LEN = 1;                   // Specify to ISR that the next transfer
                                       // will contain one data byte

   // Initiate SMBus Transfer
   STA = 1;

}





//-----------------------------------------------------------------------------
// EEPROM_WriteArray ()
//-----------------------------------------------------------------------------
//
// Return Value : None
// Parameters   :
//   1) U16 dest_addr - beginning address to write to in the EEPROM
//                        range is: 0 to 512
//
//   2) U8* src_addr - pointer to the array of data to be written
//                        range is full range of character: 0 to 255
//
//   3) U8 len - length of the array to be written to the EEPROM
//                        range is full range of character: 0 to 255
//
// Writes <len> data bytes to the EEPROM slave specified by the <EEPROM_ADDR>
// constant.
//
//-----------------------------------------------------------------------------
void EEPROM_WriteArray(U16 dest_addr, U8* src_addr, U8 len)
{
   U8 i;
   U8* pData = (U8*) src_addr;

   for( i = 0; i < len; i++ ){
      EEPROM_ByteWrite(dest_addr++, *pData++);
   }

}
 
//-----------------------------------------------------------------------------
// EEPROM_ByteRead ()
//-----------------------------------------------------------------------------
//
// Return Value :
//   1) U8 data - data read from address <addr> in the EEPROM
//                        range is full range of character: 0 to 255
//
// Parameters   :
//   1) U16 addr - address to read data from the EEPROM
//                        range is: 0 to 512
//
// This function returns a single byte from location <addr> in the EEPROM then
// polls the <SMB_BUSY> flag until the read is complete.
//
//-----------------------------------------------------------------------------
U8 EEPROM_ByteRead(U16 addr)
{
   U8 retval;                          // Holds the return value

   while (SMB_BUSY);                   // Wait for SMBus to be free.
   SMB_BUSY = 1;                       // Claim SMBus (set to busy)

   // Set SMBus ISR parameters
   TARGET = EEPROM_ADDR;               // Set target slave address
   SMB_RW = WRITE;                     // A random read starts as a write
                                       // then changes to a read after
                                       // the repeated start is sent. The
                                       // ISR handles this switchover if
                                       // the <SMB_RANDOMREAD> bit is set.
   SMB_SENDWORDADDR = 1;               // Send Word Address after Slave Address
   SMB_RANDOMREAD = 1;                 // Send a START after the word address
   SMB_ACKPOLL = 1;                    // Enable Acknowledge Polling


   // Specify the Incoming Data
   if ((addr & 0x100) == 0x100)        // Check to see if accessing upper 256
                                       // bytes of EEPROM
   {                                   
      WORD_ADDR = (addr & 0x0FF);      // Set the target address of EEPROM
      TARGET |= UPPER_MEM_BANK;        // Set bit to access upper 256 bytes of
   }                                   // EEPROM
   else
   {
      WORD_ADDR = addr;                // Set the target address in the
   }                                   // EEPROM's internal memory space   
   
   pSMB_DATA_IN = &retval;             // The incoming data pointer points to
                                       // the <retval> variable.

