VladimirP1/si1000-rf-beacon/extlibs/MCU/Examples/C8051F39x_37x/EEPROM/F37x_EEPROM.c
   SMB_DATA_LEN = 1;                   // Specify to ISR that the next transfer
                                       // will contain one data byte

   // Initiate SMBus Transfer
   STA = 1;
   while(SMB_BUSY);                    // Wait until data is read

   return retval;

}

//-----------------------------------------------------------------------------
// EEPROM_ReadArray ()
//-----------------------------------------------------------------------------
//
// Return Value : None
// Parameters   :
//   1) U8* dest_addr - pointer to the array that will be filled
//                                 with the data from the EEPROM
//                        range is full range of character: 0 to 255
//
//   2) U16 src_addr - beginning address to read data from the EEPROM
//                        range is: 0 to 512
//
//   3) U8 len - length of the array to be read from the EEPROM
//                        range is: 0 to 255
//
// Reads up to 256 data bytes from the EEPROM slave specified by the
// <EEPROM_ADDR> constant.
//
//-----------------------------------------------------------------------------
void EEPROM_ReadArray (U8* dest_addr, U16 src_addr, U8 len)
{
   while (SMB_BUSY);                   // Wait for SMBus to be free.
   SMB_BUSY = 1;                       // Claim SMBus (set to busy)

   // Set SMBus ISR parameters
   TARGET = EEPROM_ADDR;               // Set target slave address
   SMB_RW = WRITE;                     // A random read starts as a write
                                       // then changes to a read after
                                       // the repeated start is sent. The
                                       // ISR handles this switchover if
                                       // the <SMB_RANDOMREAD> bit is set.
   SMB_SENDWORDADDR = 1;               // Send Word Address after Slave Address
   SMB_RANDOMREAD = 1;                 // Send a START after the word address
   SMB_ACKPOLL = 1;                    // Enable Acknowledge Polling

   // Specify the Incoming Data
   if ((src_addr & 0x100) == 0x100)    // Check to see if accessing upper 256
                                       // bytes of EEPROM
   {                                   
      WORD_ADDR = (src_addr & 0x0FF);  // Set the target address of EEPROM
      TARGET |= UPPER_MEM_BANK;        // Set bit to access upper 256 bytes of
   }                                   // EEPROM
   else
   {
      WORD_ADDR = src_addr;             // Set the target address in the
   } 

   // Set the the incoming data pointer
   pSMB_DATA_IN = (U8*) dest_addr;


   SMB_DATA_LEN = len;                 // Specify to ISR that the next transfer
                                       // will contain <len> data bytes


   // Initiate SMBus Transfer
   STA = 1;
   while(SMB_BUSY);                    // Wait until data is read

}

//-----------------------------------------------------------------------------
// End Of File
//-----------------------------------------------------------------------------
